<h1>Pandas 1 V1</h1>
<hr>

In [1]:
import pandas as pd

In [2]:
stuff = pd.Series(data = [30,6,'yes','no'],index = ['eggs','apples','milk','bread'])
stuff

eggs       30
apples      6
milk      yes
bread      no
dtype: object

In [3]:
stuff.shape

(4,)

In [4]:
stuff.ndim

1

In [5]:
stuff.size

4

In [6]:
stuff.index

Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

In [7]:
stuff.values

array([30, 6, 'yes', 'no'], dtype=object)

In [8]:
'Bananas' in stuff

False

<h1>Pandas 2 V1</h1>
<hr>

In [9]:
stuff['eggs']

30

In [10]:
stuff[['milk','bread']]

milk     yes
bread     no
dtype: object

In [11]:
stuff[0]

30

In [12]:
stuff[-1]

'no'

In [13]:
stuff[[0,1]]

eggs      30
apples     6
dtype: object

In [14]:
stuff.loc['eggs']

30

In [15]:
stuff.iloc[0]

30

In [16]:
stuff['eggs'] = 2

In [17]:
stuff

eggs        2
apples      6
milk      yes
bread      no
dtype: object

In [18]:
stuff.drop('apples')
stuff

eggs        2
apples      6
milk      yes
bread      no
dtype: object

In [19]:
stuff.drop('apples',inplace=True)
stuff

eggs       2
milk     yes
bread     no
dtype: object

<h1>Pandas 3 V1</h1>
<hr>

In [20]:
fruits = pd.Series([10,6,3],['apples','oranges','bananas'])

In [21]:
fruits + 2

apples     12
oranges     8
bananas     5
dtype: int64

In [23]:
fruits - 2

apples     8
oranges    4
bananas    1
dtype: int64

In [24]:
fruits *2

apples     20
oranges    12
bananas     6
dtype: int64

In [25]:
fruits /2

apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

In [26]:
import numpy as np

In [27]:
np.sqrt(fruits)

apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

In [28]:
np.exp(fruits)

apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

In [29]:
np.power(fruits,2)

apples     100
oranges     36
bananas      9
dtype: int64

In [30]:
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [31]:
fruits['bananas'] + 2

5

In [32]:
fruits.iloc[0]  - 2

8

In [34]:
fruits[['apples','oranges']] * 2

apples     20
oranges    12
dtype: int64

In [35]:
fruits.loc[['apples','oranges']] / 2

apples     5.0
oranges    3.0
dtype: float64

In [36]:
stuff * 2

eggs          4
milk     yesyes
bread      nono
dtype: object

In [37]:
stuff / 2

TypeError: unsupported operand type(s) for /: 'str' and 'int'

<h1> Pandas 4 V1<h1>
<hr>

In [38]:
items = {'Bob':pd.Series([245,25,55],index=['bike','pants','watch']),
        'Alice':pd.Series([40,110,500,45],index=['book','glasses','bike','pants'])}

In [41]:
shopping_cart = pd.DataFrame(items)
shopping_cart

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [42]:
data = {'Bob':pd.Series([245,24,55]),
       'Alice':pd.Series([40,110,500,45])}
df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   24.0    110
2   55.0    500
3    NaN     45

In [43]:
shopping_cart.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [44]:
shopping_cart.shape

(5, 2)

In [45]:
shopping_cart.ndim

2

In [46]:
shopping_cart.size

10

In [48]:
bob_shopping_cart = pd.DataFrame(items,columns = ['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [49]:
sel_shopping_cart = pd.DataFrame(items,index = ['pants','book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [50]:
alice_shopping_cart = pd.DataFrame(items,index = ['glasses','bike'],columns=['Alice'])
alice_shopping_cart

         Alice
glasses    110
bike       500

In [52]:
data = {'Integers':[1,2,3],
       'Floats':[4.5,8.2,9.6]}
df = pd.DataFrame(data,index = ['label 1','label 2','label 3'])
df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

<h1> Pandas 5 V1</h1>
<hr>

In [54]:
df[['Integers']]

         Integers
label 1         1
label 2         2
label 3         3

In [55]:
df [['Integers','Floats']]

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

In [56]:
df.loc[['label 1']]

         Integers  Floats
label 1         1     4.5

In [58]:
df['Integers']['label 1']

1

In [60]:
df['string'] = ['hi','rami','rafee']
df

         Integers  Floats string
label 1         1     4.5     hi
label 2         2     8.2   rami
label 3         3     9.6  rafee

In [61]:
df['sum'] = df['Integers'] + df['Floats']
df

         Integers  Floats string   sum
label 1         1     4.5     hi   5.5
label 2         2     8.2   rami  10.2
label 3         3     9.6  rafee  12.6

In [63]:
new_items = [{'bikes':20,'pants':30,'watches':35,'glasses':4}]
new_store = pd.DataFrame(new_items,index=['store 3'])
new_store

         bikes  pants  watches  glasses
store 3     20     30       35        4

In [66]:
df.append(new_store)
df

C:\Users\Rami\AppData\Local\Temp\ipykernel_14900\1461517092.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(new_store)

         Integers  Floats string   sum
label 1         1     4.5     hi   5.5
label 2         2     8.2   rami  10.2
label 3         3     9.6  rafee  12.6

In [68]:
df['Integers'] = df['Integers'][1:]
df

         Integers  Floats string   sum
label 1       NaN     4.5     hi   5.5
label 2       2.0     8.2   rami  10.2
label 3       3.0     9.6  rafee  12.6

In [70]:
df.insert(1,'shoes',[9,8,5])
df

         Integers  shoes  Floats string   sum
label 1       NaN      9     4.5     hi   5.5
label 2       2.0      8     8.2   rami  10.2
label 3       3.0      5     9.6  rafee  12.6

In [71]:
df.pop('string')
df

         Integers  shoes  Floats   sum
label 1       NaN      9     4.5   5.5
label 2       2.0      8     8.2  10.2
label 3       3.0      5     9.6  12.6

In [72]:
df.drop(['shoes','sum'],axis = 1,inplace=True)
df

         Integers  Floats
label 1       NaN     4.5
label 2       2.0     8.2
label 3       3.0     9.6

<h1>Pandas 6 V1</h1>
<hr>

In [74]:
shopping_cart

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [76]:
x = shopping_cart.isnull().sum().sum()
print(x)

3

In [77]:
shopping_cart.count()

Bob      3
Alice    4
dtype: int64

In [80]:
print(shopping_cart.dropna(axis = 0))
shopping_cart

         Bob  Alice
bike   245.0  500.0
pants   25.0   45.0

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [81]:
print(shopping_cart.dropna(axis = 1))
shopping_cart

Empty DataFrame
Columns: []
Index: [bike, book, glasses, pants, watch]

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [82]:
shopping_cart.fillna(0)

           Bob  Alice
bike     245.0  500.0
book       0.0   40.0
glasses    0.0  110.0
pants     25.0   45.0
watch     55.0    0.0

In [83]:
shopping_cart

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [84]:
shopping_cart.interpolate(method='linear',axis=0)

                Bob  Alice
bike     245.000000  500.0
book     171.666667   40.0
glasses   98.333333  110.0
pants     25.000000   45.0
watch     55.000000   45.0

<h1>Pandas 7 V1</h1>
<hr>